# Assignment 1 : Python Data Analysis using salaries dataset

# Data Exploration:  This should include summary statistics, means, medians, quartiles, or any other relevant information about the data set.

In [2]:
import pandas as pd 
import numpy as np
import matplotlib.pyplot as plt
%matplotlib inline

In [3]:
df = pd.read_csv('https://raw.githubusercontent.com/CunyLaguardiaDataAnalytics/datasets/master/Salaries.csv')

In [4]:
type(df)

pandas.core.frame.DataFrame

In [6]:
# 397 rows = 397 employees
df.shape

(397, 7)

In [7]:
df.head()

   Unnamed: 0      rank discipline  yrs.since.phd  yrs.service   sex  salary
0           1      Prof          B             19           18  Male  139750
1           2      Prof          B             20           16  Male  173200
2           3  AsstProf          B              4            3  Male   79750
3           4      Prof          B             45           39  Male  115000
4           5      Prof          B             40           41  Male  141500

In [8]:
df.tail()

     Unnamed: 0      rank discipline  yrs.since.phd  yrs.service   sex  salary
392         393      Prof          A             33           30  Male  103106
393         394      Prof          A             31           19  Male  150564
394         395      Prof          A             42           25  Male  101738
395         396      Prof          A             25           15  Male   95329
396         397  AsstProf          A              8            4  Male   81035

In [9]:
df.describe()

       Unnamed: 0  yrs.since.phd  yrs.service         salary
count  397.000000     397.000000   397.000000     397.000000
mean   199.000000      22.314861    17.614610  113706.458438
std    114.748275      12.887003    13.006024   30289.038695
min      1.000000       1.000000     0.000000   57800.000000
25%    100.000000      12.000000     7.000000   91000.000000
50%    199.000000      21.000000    16.000000  107300.000000
75%    298.000000      32.000000    27.000000  134185.000000
max    397.000000      56.000000    60.000000  231545.000000

# Mean/median of all salaries

In [10]:
# Mean of all salaries
mean = df['salary'].describe()
print("the mean of all salaries is ",mean[1])

the mean of all salaries is  113706.45843828715

In [11]:
# Median of all salaries
salaries = df.describe().loc['50%'].iloc[3]
print("median of all salaries: ",salaries)

median of all salaries:  107300.0

# Median salary between gender and/or rank(title) Etc...

Making a new Data Frame that only has the columns 'sex' and 'salary'

In [15]:
sex_and_salary = df[['sex','salary']]

#print(sex_and_salary)

Finding the Median salary for all males

In [16]:
med_males =sex_and_salary[ sex_and_salary['sex'] == 'Male']
#print(med_males)

In [14]:
med_males['salary'].median()

108043.0

Finding the Median salary for all females

In [19]:
med_females = sex_and_salary[ sex_and_salary['sex']== 'Female']

#print(med_females)

103750.0

In [20]:
med_females['salary'].median()

103750.0

Comparing the Mean salary of Males and Females

In [26]:
m = sex_and_salary[sex_and_salary['sex'] == 'Male']

m_mean = m['salary'].mean()
print(m_mean)

115090.41899441341

In [29]:
f_mean = med_females['salary'].mean()
print(f_mean)

101002.41025641025

In [32]:
# The difference between mean salaries of male and female

compare = m_mean - f_mean

print(compare)

14088.008738003162

# Data Wrangling – perform some basic transformations on the data

People who have 20 years of experience (Total: 157), (Mean Salary: 122,520.66)

In [48]:
exper_salary = df[['yrs.service', 'salary']]

#print(exper_salary)

In [47]:
Ex20 = exper_salary[exper_salary['yrs.service']>=20]

#print(Ex20)

In [58]:
Mean20 = Ex20['salary'].mean()

print("mean salary =",Mean20)

mean salary = 122520.65605095541

Comparing the salaries of people who have 20+ years of experience vs less than 20 years of experience

In [62]:
less20 = exper_salary[exper_salary['yrs.service']<20]

#print(less20)

In [54]:
Mless = less20['salary'].mean()

print(Mless)

107940.50416666667

In [57]:
comp20 = Mean20 - Mless

print("there is a ", comp20, " difference.")

there is a  14580.151884288745  difference.

People who have salary of greater than or equal to 200,000

In [60]:
salaries = exper_salary[exper_salary['salary']>=200000]

print(salaries)

     yrs.service  salary
43            38  231545
249            7  204000
364           43  205500

Your Findings here...

# Create some simple visualizations showing some simple statistics

Your observations from the visuals:

# Draw some conclusions based on the data.  What did you discover?

Based on the analysis performed above, the conclusions are as follows:


* The median salary for all females is 103750.0 and all males is 108043.0

* Only 3 people have salary of equal or greater than 200,000

* People get $1458.15 more salary if they have more than 20 years of experience.